## staging: common
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 12 to add, 4 to change, 8 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                                         NAME                                                         |
|----------|----------------------------------------------------------------------------------------------------------------------|
| update   | `module.notify_slack_critical.module.lambda.aws_lambda_function.this[0]`                                             |
|          | `module.notify_slack_general.module.lambda.aws_lambda_function.this[0]`                                              |
|          | `module.notify_slack_ok.module.lambda.aws_lambda_function.this[0]`                                                   |
|          | `module.notify_slack_warning.module.lambda.aws_lambda_function.this[0]`                                              |
| recreate | `module.notify_slack_critical.module.lambda.aws_lambda_permission.current_version_triggers[&quot;AllowExecutionFromSNS&quot;]` |
|          | `module.notify_slack_critical.module.lambda.null_resource.archive[0]`                                                |
|          | `module.notify_slack_general.module.lambda.aws_lambda_permission.current_version_triggers[&quot;AllowExecutionFromSNS&quot;]`  |
|          | `module.notify_slack_general.module.lambda.null_resource.archive[0]`                                                 |
|          | `module.notify_slack_ok.module.lambda.aws_lambda_permission.current_version_triggers[&quot;AllowExecutionFromSNS&quot;]`       |
|          | `module.notify_slack_ok.module.lambda.null_resource.archive[0]`                                                      |
|          | `module.notify_slack_warning.module.lambda.aws_lambda_permission.current_version_triggers[&quot;AllowExecutionFromSNS&quot;]`  |
|          | `module.notify_slack_warning.module.lambda.null_resource.archive[0]`                                                 |
| add      | `module.notify_slack_critical.module.lambda.local_file.archive_plan[0]`                                              |
|          | `module.notify_slack_general.module.lambda.local_file.archive_plan[0]`                                               |
|          | `module.notify_slack_ok.module.lambda.local_file.archive_plan[0]`                                                    |
|          | `module.notify_slack_warning.module.lambda.local_file.archive_plan[0]`                                               |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.notify_slack_critical.module.lambda.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/1e622be40890679d302c03a6096c334d64151aab5aee3e073035598ee5e01db2.zip" -> "builds/642ccf6c7bec41f4477f2b81da054835e312bb0f6f00de5163a908f55362c48a.zip"
        id                             = "notify-slack-critical"
      ~ last_modified                  = "2025-01-28T16:41:16.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:239043911459:function:notify-slack-critical:12" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:239043911459:function:notify-slack-critical:12/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "12" -> (known after apply)
        # (24 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.notify_slack_critical.module.lambda.aws_lambda_permission.current_version_triggers["AllowExecutionFromSNS"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "AllowExecutionFromSNS" -> (known after apply)
      ~ qualifier           = "12" # forces replacement -> (known after apply) # forces replacement
      + statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.notify_slack_critical.module.lambda.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + "zip",
                      + ".terraform/modules/notify_slack_critical/functions/notify_slack.py",
                      + null,
                    ],
                ]
              + filename      = "builds/642ccf6c7bec41f4477f2b81da054835e312bb0f6f00de5163a908f55362c48a.zip"
              + runtime       = "python3.11"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/642ccf6c7bec41f4477f2b81da054835e312bb0f6f00de5163a908f55362c48a.plan.json"
      + id                   = (known after apply)
    }

  # module.notify_slack_critical.module.lambda.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "2501469164170488285" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/1e622be40890679d302c03a6096c334d64151aab5aee3e073035598ee5e01db2.zip" -> "builds/642ccf6c7bec41f4477f2b81da054835e312bb0f6f00de5163a908f55362c48a.zip"
            # (1 unchanged element hidden)
        }
    }

  # module.notify_slack_general.module.lambda.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/2c26292ef7673e1f67a17eeecb7e7e2729a987663fdec0eb8f3028fce40d5ab4.zip" -> "builds/7f7fb0010a67e236732c1e94c869f73e02b20cd051c03c379a68192cbaef0f26.zip"
        id                             = "notify-slack-general"
      ~ last_modified                  = "2025-01-28T16:41:10.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:239043911459:function:notify-slack-general:10" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:239043911459:function:notify-slack-general:10/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "10" -> (known after apply)
        # (24 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.notify_slack_general.module.lambda.aws_lambda_permission.current_version_triggers["AllowExecutionFromSNS"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "AllowExecutionFromSNS" -> (known after apply)
      ~ qualifier           = "10" # forces replacement -> (known after apply) # forces replacement
      + statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.notify_slack_general.module.lambda.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + "zip",
                      + ".terraform/modules/notify_slack_general/functions/notify_slack.py",
                      + null,
                    ],
                ]
              + filename      = "builds/7f7fb0010a67e236732c1e94c869f73e02b20cd051c03c379a68192cbaef0f26.zip"
              + runtime       = "python3.11"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/7f7fb0010a67e236732c1e94c869f73e02b20cd051c03c379a68192cbaef0f26.plan.json"
      + id                   = (known after apply)
    }

  # module.notify_slack_general.module.lambda.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "9218677760450414008" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/2c26292ef7673e1f67a17eeecb7e7e2729a987663fdec0eb8f3028fce40d5ab4.zip" -> "builds/7f7fb0010a67e236732c1e94c869f73e02b20cd051c03c379a68192cbaef0f26.zip"
            # (1 unchanged element hidden)
        }
    }

  # module.notify_slack_ok.module.lambda.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/c0bc8d02f0098b178b87a31e448515f17dfa6165f117bbeca9526aa66b9266f3.zip" -> "builds/c517b3051b5a16a86d4e145cb3da878647efbbc59be955480ed0d151c85a8c29.zip"
        id                             = "notify-slack-ok"
      ~ last_modified                  = "2025-01-28T16:41:28.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:239043911459:function:notify-slack-ok:6" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:239043911459:function:notify-slack-ok:6/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "6" -> (known after apply)
        # (24 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.notify_slack_ok.module.lambda.aws_lambda_permission.current_version_triggers["AllowExecutionFromSNS"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "AllowExecutionFromSNS" -> (known after apply)
      ~ qualifier           = "6" # forces replacement -> (known after apply) # forces replacement
      + statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.notify_slack_ok.module.lambda.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + "zip",
                      + ".terraform/modules/notify_slack_ok/functions/notify_slack.py",
                      + null,
                    ],
                ]
              + filename      = "builds/c517b3051b5a16a86d4e145cb3da878647efbbc59be955480ed0d151c85a8c29.zip"
              + runtime       = "python3.11"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/c517b3051b5a16a86d4e145cb3da878647efbbc59be955480ed0d151c85a8c29.plan.json"
      + id                   = (known after apply)
    }

  # module.notify_slack_ok.module.lambda.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "5844246384624297876" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/c0bc8d02f0098b178b87a31e448515f17dfa6165f117bbeca9526aa66b9266f3.zip" -> "builds/c517b3051b5a16a86d4e145cb3da878647efbbc59be955480ed0d151c85a8c29.zip"
            # (1 unchanged element hidden)
        }
    }

  # module.notify_slack_warning.module.lambda.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/19863096150fa1a6df6f86bf4faddd68a0875c2a3c199bd42c44f533dcd009d3.zip" -> "builds/e0fd1bbb9b256c063d49b06648d97e4676c1c402e0eada62d0e678d326f4598e.zip"
        id                             = "notify-slack-warning"
      ~ last_modified                  = "2025-01-28T16:41:22.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:239043911459:function:notify-slack-warning:12" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:239043911459:function:notify-slack-warning:12/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "12" -> (known after apply)
        # (24 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.notify_slack_warning.module.lambda.aws_lambda_permission.current_version_triggers["AllowExecutionFromSNS"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "AllowExecutionFromSNS" -> (known after apply)
      ~ qualifier           = "12" # forces replacement -> (known after apply) # forces replacement
      + statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.notify_slack_warning.module.lambda.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + "zip",
                      + ".terraform/modules/notify_slack_warning/functions/notify_slack.py",
                      + null,
                    ],
                ]
              + filename      = "builds/e0fd1bbb9b256c063d49b06648d97e4676c1c402e0eada62d0e678d326f4598e.zip"
              + runtime       = "python3.11"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/e0fd1bbb9b256c063d49b06648d97e4676c1c402e0eada62d0e678d326f4598e.plan.json"
      + id                   = (known after apply)
    }

  # module.notify_slack_warning.module.lambda.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "6130839674928242247" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/19863096150fa1a6df6f86bf4faddd68a0875c2a3c199bd42c44f533dcd009d3.zip" -> "builds/e0fd1bbb9b256c063d49b06648d97e4676c1c402e0eada62d0e678d326f4598e.zip"
            # (1 unchanged element hidden)
        }
    }

Plan: 12 to add, 4 to change, 8 to destroy.

Warning: Argument is deprecated

  with aws_s3_bucket.csv_bucket,
  on s3.tf line 5, in resource "aws_s3_bucket" "csv_bucket":
   5: resource "aws_s3_bucket" "csv_bucket" {

Use the aws_s3_bucket_lifecycle_configuration resource instead

(and 66 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.ad_hoc"]
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.build_tables"]
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.primary"]
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.support"]
WARN - plan.json - main - Missing Common Tags: ["aws_budgets_budget.cloudwatch_data_scanned"]
WARN - plan.json - main - Missing Common Tags: ["aws_budgets_budget.notify_global"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.aws_health[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.route53_resolver_query_log[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures_us_west_2[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_us_west_2[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-bulk-not-being-processed-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-bulk-not-being-processed-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-inflights-not-being-processed-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-inflights-not-being-processed-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-not-being-processed-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-not-being-processed-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.contact-3-500-error-15-minutes-critical[0]"]
WARN - plan.json - main - Missing Common...
```

</details>
